Κανόνες Μεταγλώττισης και Εκτέλεσης του Κώδικα
Για να μεταγλωττίσουμε και να εκτελέσουμε σωστά τον κώδικα του e-shop, ακολουθούμε τα παρακάτω βήματα:

1. Εγκατάσταση των απαραίτητων εργαλείων
Βεβαιωθείτε ότι έχετε εγκατεστημένο τον μεταγλωττιστή gcc στο σύστημά σας. Σε Ubuntu/Debian μπορείτε να τον εγκαταστήσετε με:

2. Μεταγλώττιση του κώδικα
Ο κώδικας περιλαμβάνει διαχείριση διεργασιών (fork) και sockets, επομένως πρέπει να μεταγλωττιστεί με τις σωστές βιβλιοθήκες. Χρησιμοποιούμε την εξής εντολή για μεταγλώττιση


3. Εκκίνηση του Server
Για να εκτελέσουμε τον server, πληκτρολογούμε:

./eshop server
Ο server εκκινεί και περιμένει συνδέσεις από πελάτες.

4. Εκκίνηση των Clients
Σε ένα άλλο τερματικό, εκτελούμε:

./eshop client
Αυτό δημιουργεί CLIENT_COUNT πελάτες που συνδέονται στον server και υποβάλλουν παραγγελίες.

5. Παρακολούθηση της Αναφοράς
Μετά την ολοκλήρωση όλων των συναλλαγών, ο server εμφανίζει μια αναφορά με τα στατιστικά των παραγγελιών.

6. Καθαρισμός Εκτελέσιμων Αρχείων
Αν θέλετε να αφαιρέσετε το εκτελέσιμο αρχείο μετά τη δοκιμή, χρησιμοποιήστε:

rm eshop
Ακολουθώντας αυτά τα βήματα, διασφαλίζετε τη σωστή μεταγλώττιση και εκτέλεση του e-shop server και των clients.
